Model: "model_87"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_5 (InputLayer)            [(None, 7, 7, 512)]  0                                            
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 7, 7, 128)    65664       input_5[0][0]                    
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 7, 7, 1)      129         conv2d_6[0][0]                   
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 7, 7, 512)    1024        conv2d_7[0][0]                   
__________________________________________________________________________________________________
multiply_2 (Multiply)           (None, 7, 7, 512)    0           input_5[0][0]                    
                                                                 conv2d_8[0][0]                   
__________________________________________________________________________________________________
global_average_pooling2d_2 (Glo (None, 512)          0           multiply_2[0][0]                 
__________________________________________________________________________________________________
dropout_4 (Dropout)             (None, 512)          0           global_average_pooling2d_2[0][0] 
__________________________________________________________________________________________________
dense_4 (Dense)                 (None, 500)          256500      dropout_4[0][0]                  
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 500)          2000        dense_4[0][0]                    
__________________________________________________________________________________________________
activation_2 (Activation)       (None, 500)          0           batch_normalization_2[0][0]      
__________________________________________________________________________________________________
dropout_5 (Dropout)             (None, 500)          0           activation_2[0][0]               
__________________________________________________________________________________________________
dense_5 (Dense)                 (None, 2)            1002        dropout_5[0][0]                  
==================================================================================================
Total params: 326,319
Trainable params: 325,319
Non-trainable params: 1,000
__________________________________________________________________________________________________
