Model: "model_1"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_4 (InputLayer)            [(None, 7, 7, 2048)] 0                                            
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 7, 7, 516)    1057284     input_4[0][0]                    
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 7, 7, 1)      517         conv2d_3[0][0]                   
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 7, 7, 2048)   4096        conv2d_4[0][0]                   
__________________________________________________________________________________________________
multiply_1 (Multiply)           (None, 7, 7, 2048)   0           input_4[0][0]                    
                                                                 conv2d_5[0][0]                   
__________________________________________________________________________________________________
global_average_pooling2d_1 (Glo (None, 2048)         0           multiply_1[0][0]                 
__________________________________________________________________________________________________
dropout_2 (Dropout)             (None, 2048)         0           global_average_pooling2d_1[0][0] 
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 500)          1024500     dropout_2[0][0]                  
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 500)          2000        dense_2[0][0]                    
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 500)          0           batch_normalization_1[0][0]      
__________________________________________________________________________________________________
dropout_3 (Dropout)             (None, 500)          0           activation_1[0][0]               
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 2)            1002        dropout_3[0][0]                  
==================================================================================================
Total params: 2,089,399
Trainable params: 2,088,399
Non-trainable params: 1,000
__________________________________________________________________________________________________
