Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_3 (InputLayer)            [(None, 7, 7, 2560)] 0                                            
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 7, 7, 516)    1321476     input_3[0][0]                    
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 7, 7, 1)      517         conv2d[0][0]                     
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 7, 7, 2560)   5120        conv2d_1[0][0]                   
__________________________________________________________________________________________________
multiply (Multiply)             (None, 7, 7, 2560)   0           input_3[0][0]                    
                                                                 conv2d_2[0][0]                   
__________________________________________________________________________________________________
global_average_pooling2d (Globa (None, 2560)         0           multiply[0][0]                   
__________________________________________________________________________________________________
dropout (Dropout)               (None, 2560)         0           global_average_pooling2d[0][0]   
__________________________________________________________________________________________________
dense (Dense)                   (None, 500)          1280500     dropout[0][0]                    
__________________________________________________________________________________________________
batch_normalization (BatchNorma (None, 500)          2000        dense[0][0]                      
__________________________________________________________________________________________________
activation (Activation)         (None, 500)          0           batch_normalization[0][0]        
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 500)          0           activation[0][0]                 
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 2)            1002        dropout_1[0][0]                  
==================================================================================================
Total params: 2,610,615
Trainable params: 2,609,615
Non-trainable params: 1,000
__________________________________________________________________________________________________
